In [17]:
import pandas as pd

In [9]:
raw_data = {'city': ['Tripoli', 'Tripoli', 'Rome', 'Rome', 'Sydney', 'Sydney'], 
        'rank': ['1st', '2nd', '1st', '2nd', '1st', '2nd'], 
        'name': ['Noureddin', 'Adam', 'Kevin', 'Raihana', 'Raghad', 'Mahdi'], 
        'score1': [44, 48, 39, 41, 38, 44],
        'score2': [67, 63, 55, 70, 64, 77]}

In [18]:
df = pd.DataFrame(raw_data, columns = ['city', 'rank', 'name', 'score1', 'score2'])

In [19]:
df

      city rank       name  score1  score2
0  Tripoli  1st  Noureddin      44      67
1  Tripoli  2nd       Adam      48      63
2     Rome  1st      Kevin      39      55
3     Rome  2nd    Raihana      41      70
4   Sydney  1st     Raghad      38      64
5   Sydney  2nd      Mahdi      44      77

In [22]:
df.set_index(['city', 'rank'], drop=False,inplace=True)

In [23]:
df

                 city rank       name  score1  score2
city    rank
Tripoli 1st   Tripoli  1st  Noureddin      44      67
        2nd   Tripoli  2nd       Adam      48      63
Rome    1st      Rome  1st      Kevin      39      55
        2nd      Rome  2nd    Raihana      41      70
Sydney  1st    Sydney  1st     Raghad      38      64
        2nd    Sydney  2nd      Mahdi      44      77

In [24]:
df.index

MultiIndex(levels=[['Rome', 'Sydney', 'Tripoli'], ['1st', '2nd']],
           labels=[[2, 2, 0, 0, 1, 1], [0, 1, 0, 1, 0, 1]],
           names=['city', 'rank'])